app/Controllers/Usuario_controller.php

    public function formValidation(){
        $input = $this->validate([
            'nombre'    => 'required|min_length[3]',
            'apellido'  => 'required|min_length[3]|max_length[50]',
            'usuario'   => 'required|min_length[3]',
            'email'     => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'pass'      => 'required|min_length[3]|max_length[10]'

        ],
        );

        $formModel = new Usuarios_model();

        if (!$input) {
            $data['titulo'] = 'registro';
            echo view('front/header_view', $data);
            echo view('front/nav_view');
            echo view('back/usuario/registro', ['validation' => $this->validator]);
            echo view('front/footer_view');


        } else {
            $formModel->save([
                'nombre'    => $this->request->getVar('nombre'),
                'apellido'  => $this->request->getVar('apellido'),
                'usuario'   => $this->request->getVar('usuario'),
                'email'     => $this->request->getVar('email'),
                'pass'      => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
                //pasword_hash() crea un nuevo hash de contraseña usando un algoritmo de hash de unico sentido
                'perfil_id'  => 2
            ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`, `perfil_id`) VALUES ('Juliet', 'Garcia', 'juli09', 'juli@ejemplo.com', '$2y$10$XdoMkE8mrGG6jUqlQ/y0LOvqTIqqu3kb4Spf3u37XR1UcBi/CO96W', 2)