app/Models/categoria_model.php

    public function getCategorias()
    {
        return $this->findAll();
---
SELECT *
FROM `categorias`