app/Models/consulta_model.php

    public function getConsultas()
    {
        return $this->findAll();
---
SELECT *
FROM `consultas`