app/Models/Ventas_detalle_model.php

    public function getDetalles($id = null, $id_usuario = null){
        $db = \Config\Database::connect();
        $builder = $db->table('ventas_detalle');
        $builder->select('*');
        $builder->join('ventas_cabecera', 'ventas_cabecera.id = ventas_detalle.venta_id');
        $builder->join('productos', 'productos.id = ventas_detalle.producto_id');
        $builder->join('usuarios', 'usuarios.id_usuario = ventas_cabecera.usuario_id');
        if($id != null){
            $builder->where('ventas_cabecera.id', $id);
        }

        $query = $builder->get();
---
SELECT *
FROM `ventas_detalle`
JOIN `ventas_cabecera` ON `ventas_cabecera`.`id` = `ventas_detalle`.`venta_id`
JOIN `productos` ON `productos`.`id` = `ventas_detalle`.`producto_id`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas_cabecera`.`usuario_id`